## Pandas Group by

In [9]:
# setup environment
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline
import scipy
import seaborn as sns 

print("Done")

Done

In [3]:
df = pd.DataFrame(
   ...:     [
   ...:         ("bird", "Falconiformes", 389.0),
   ...:         ("bird", "Psittaciformes", 24.0),
   ...:         ("mammal", "Carnivora", 80.2),
   ...:         ("mammal", "Primates", np.nan),
   ...:         ("mammal", "Carnivora", 58),
   ...:     ],
   ...:     index=["falcon", "parrot", "lion", "monkey", "leopard"],
   ...:     columns=("class", "order", "max_speed"),
   ...: )

In [6]:
group1 = df.groupby(["class"])

In [8]:
group1.first()

                order  max_speed
class
bird    Falconiformes      389.0
mammal      Carnivora       80.2

## How group by works 
- Split a table into groups 
- Apply some operations on each of the the smaller tables 
- Combine the results

In [31]:
for class_, frame in group1:
    print(f"First two entries for {class_!r}")
    print("-"*30)
    print(frame.head(2), end="\n\n")

First two entries for 'bird'
------------------------------
       class           order  max_speed
falcon  bird   Falconiformes      389.0
parrot  bird  Psittaciformes       24.0

First two entries for 'mammal'
------------------------------
         class      order  max_speed
lion    mammal  Carnivora       80.2
monkey  mammal   Primates        NaN

In [11]:
group1.groups

{'bird': ['falcon', 'parrot'], 'mammal': ['lion', 'monkey', 'leopard']}

In [12]:
group2 = df.groupby(["order"])

In [13]:
group2.groups

{'Carnivora': ['lion', 'leopard'], 'Falconiformes': ['falcon'], 'Primates': ['monkey'], 'Psittaciformes': ['parrot']}

 the .groups attribute will give you a dict of {group name: group label} pairs

- you can also use .get_group() as a way to drill down to the sub-table from a single group

In [15]:
group2.get_group("Carnivora")

          class      order  max_speed
lion     mammal  Carnivora       80.2
leopard  mammal  Carnivora       58.0

In [16]:
# this is visually equivalent to using .loc[]

In [17]:
df.loc[df["order"] == "Carnivora"]

          class      order  max_speed
lion     mammal  Carnivora       80.2
leopard  mammal  Carnivora       58.0

In [18]:
# performing aggregations

In [19]:
group1.groups

{'bird': ['falcon', 'parrot'], 'mammal': ['lion', 'monkey', 'leopard']}

In [21]:
group3 = df.groupby(["class", "order"])
group3.first()

                       max_speed
class  order
bird   Falconiformes       389.0
       Psittaciformes       24.0
mammal Carnivora            80.2
       Primates              NaN

In [26]:
group4 = df.groupby(["class", "order"], as_index=False)["max_speed"].count()
group4

    class           order  max_speed
0    bird   Falconiformes          1
1    bird  Psittaciformes          1
2  mammal       Carnivora          2
3  mammal        Primates          0

In [29]:
df.groupby("class", sort=False)["order"].count()

class
bird      2
mammal    3
Name: order, dtype: int64

In [33]:
# In the apply part 
class_, frame = next(iter(group1))
print(class_)
print(frame)

bird
       class           order  max_speed
falcon  bird   Falconiformes      389.0
parrot  bird  Psittaciformes       24.0

In [34]:
frame["max_speed"].count()

2

In [36]:
file_path = "datasets/iris.csv"
df = pd.read_csv(file_path)
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

## Grouping the Data

In [38]:
iris_classes = df.groupby("Species")

In [40]:
# list(iris_classes)
iris_classes.groups

{'Iris-setosa': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], 'Iris-versicolor': [50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 'Iris-virginica': [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]}

In [41]:
iris_classes.describe()

                   Id                                                        \
                count   mean       std    min     25%    50%     75%    max
Species
Iris-setosa      50.0   25.5  14.57738    1.0   13.25   25.5   37.75   50.0
Iris-versicolor  50.0   75.5  14.57738   51.0   63.25   75.5   87.75  100.0
Iris-virginica   50.0  125.5  14.57738  101.0  113.25  125.5  137.75  150.0

                SepalLengthCm         ... PetalLengthCm      PetalWidthCm  \
                        count   mean  ...           75%  max        count
Species                               ...
Iris-setosa              50.0  5.006  ...         1.575  1.9         50.0
Iris-versicolor          50.0  5.936  ...         4.600  5.1         50.0
Iris-virginica           50.0  6.588  ...         5.875  6.9         50.0


                  mean       std  min  25%  50%  75%  max
Species
Iris-setosa      0.244  0.107210  0.1  0.2  0.2  0.3  0.6
Iris-versicolor  1.326  0.197753  1.0  1.2  1.3  1.5  1.8
Iris-virginica   2.026  0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 40 columns]

In [44]:
# Find the avg petal width for Iris setosa
iris_classes["PetalWidthCm"].mean()

Species
Iris-setosa        0.244
Iris-versicolor    1.326
Iris-virginica     2.026
Name: PetalWidthCm, dtype: float64

In [45]:
# find the longest petal for each class

In [46]:
iris_classes["PetalLengthCm"].max()

Species
Iris-setosa        1.9
Iris-versicolor    5.1
Iris-virginica     6.9
Name: PetalLengthCm, dtype: float64

In [49]:
df.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [50]:
# how many values are in each category 
iris_classes.size()

Species
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
dtype: int64

In [51]:
iris_classes.count()

                 Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
Species
Iris-setosa      50             50            50             50            50
Iris-versicolor  50             50            50             50            50
Iris-virginica   50             50            50             50            50

## Applying Functions to Groupby groups
We can apply a function to each group by using the pandas apply() method

In [52]:
def get_stats(group):
    return {
        'min': group.min(),
        'max': group.max(),
        'avrg': group.mean(),
        'sum': group.sum()
    }

In [53]:
iris_classes.apply(get_stats)

Species
Iris-setosa        {'min': [1, 4.3, 2.3, 1.0, 0.1, 'Iris-setosa']...
Iris-versicolor    {'min': [51, 4.9, 2.0, 3.0, 1.0, 'Iris-versico...
Iris-virginica     {'min': [101, 4.9, 2.2, 4.5, 1.4, 'Iris-virgin...
dtype: object

In [54]:
get_stats(iris_classes)

{'min':                   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
 Species
 Iris-setosa        1            4.3           2.3            1.0           0.1
 Iris-versicolor   51            4.9           2.0            3.0           1.0
 Iris-virginica   101            4.9           2.2            4.5           1.4,
 'max':                   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
 Species
 Iris-setosa       50            5.8           4.4            1.9           0.6
 Iris-versicolor  100            7.0           3.4            5.1           1.8
 Iris-virginica   150            7.9           3.8            6.9           2.5,
 'avrg':                     Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  \
 Species
 Iris-setosa       25.5          5.006         3.418          1.464
 Iris-versicolor   75.5          5.936         2.770          4.260
 Iris-virginica   125.5          6.588         2.974          5.552

                  PetalWidthCm
 Species
 Iris-setosa             0.244
 Iris-versicolor         1.326
 Iris-virginica          2.026  ,
 'sum':                    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  \
 Species
 Iris-setosa      1275          250.3         170.9           73.2
 Iris-versicolor  3775          296.8         138.5          213.0
 Iris-virginica   6275          329.4         148.7          277.6

                  PetalWidthCm
 Species
 Iris-setosa              12.2
 Iris-versicolor          66.3
 Iris-virginica          101.3  }

In [ ]:
# Cardio Dataset 
# grp = df.groupby(["age_category"])["cardio"].sum()